# Toplulaştırma ve guruplama (Aggregation & Grouping)
* Basit Toplulaşma fonksiyonları;

* count()
* first()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('planets')

In [3]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [4]:
df.shape  ## 1035 gözlem ve 6 değişkenden oluşuyormuş

(1035, 6)

In [5]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [6]:
df.min()

method            Astrometry
number                     1
orbital_period      0.090706
mass                  0.0036
distance                1.35
year                    1989
dtype: object

In [7]:
df.axes

[RangeIndex(start=0, stop=1035, step=1),
 Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')]

In [8]:
df.mean(numeric_only=True)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [9]:
df['mass'].mean()

2.6381605847953216

In [11]:
df.first('year') ## 'first' only supports a DatetimeIndex index

TypeError: 'first' only supports a DatetimeIndex index

In [30]:
df.dtypes

method             object
number              int64
orbital_period    float64
mass              float64
distance          float64
year                int64
dtype: object

In [33]:
df.max()

method            Transit Timing Variations
number                                    7
orbital_period                     730000.0
mass                                   25.0
distance                             8500.0
year                                   2014
dtype: object

In [35]:
df.std(numeric_only=True)

number                1.240976
orbital_period    26014.728304
mass                  3.818617
distance            733.116493
year                  3.972567
dtype: float64

In [ ]:
df.median(numeric_only=True)

number               1.0000
orbital_period      39.9795
mass                 1.2600
distance            55.2500
year              2010.0000
dtype: float64

In [39]:
df.max()

method            Transit Timing Variations
number                                    7
orbital_period                     730000.0
mass                                   25.0
distance                             8500.0
year                                   2014
dtype: object

In [40]:
df.std(numeric_only=True)

number                1.240976
orbital_period    26014.728304
mass                  3.818617
distance            733.116493
year                  3.972567
dtype: float64

In [41]:
df.var(numeric_only=True)

number            1.540022e+00
orbital_period    6.767661e+08
mass              1.458183e+01
distance          5.374598e+05
year              1.578129e+01
dtype: float64

In [46]:
df.sum() #Return the sum of the values over the requested axis. This is equivalent to the method ``numpy.sum``.

method            Radial VelocityRadial VelocityRadial VelocityR...
number                                                         1848
orbital_period                                       1986894.255326
mass                                                     1353.37638
distance                                                  213367.98
year                                                        2079388
dtype: object

In [47]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [51]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [52]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Guruplama İşlemleri

In [54]:
df= pd.DataFrame({'guruplar' : ['A','B','C','A','B','C',],
                'veri': [10,11,52,23,43,55]}, 
                 columns=['guruplar','veri'])
df

  guruplar  veri
0        A    10
1        B    11
2        C    52
3        A    23
4        B    43
5        C    55

In [59]:
df.describe().T

      count       mean        std   min   25%   50%    75%   max
veri    6.0  32.333333  20.274779  10.0  14.0  33.0  49.75  55.0

In [60]:
df.groupby('guruplar')

In [61]:
df.groupby('guruplar').mean()

          veri
guruplar
A         16.5
B         27.0
C         53.5

In [62]:
df= sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [63]:
df.groupby('method')
df.groupby

In [65]:
df.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [68]:
df.groupby('method')['mass'].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [71]:
df.groupby('method')['mass'].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,0.0,2.000000,0.0,0.0,0.0,0.0,0.0,510.000000,1.00,0.0
mean,NaN,5.125000,NaN,NaN,NaN,NaN,NaN,2.630699,1.47,NaN
std,NaN,1.308148,NaN,NaN,NaN,NaN,NaN,3.825883,NaN,NaN
min,NaN,4.200000,NaN,NaN,NaN,NaN,NaN,0.003600,1.47,NaN
25%,NaN,4.662500,NaN,NaN,NaN,NaN,NaN,0.225250,1.47,NaN
50%,NaN,5.125000,NaN,NaN,NaN,NaN,NaN,1.260000,1.47,NaN
75%,NaN,5.587500,NaN,NaN,NaN,NaN,NaN,3.000000,1.47,NaN
max,NaN,6.050000,NaN,NaN,NaN,NaN,NaN,25.000000,1.47,NaN

## İleri toplulaştırma İşlemleri(Aggregate, Filter, Transform, apply)

In [74]:
df= pd.DataFrame({'guruplar' : ['A','B','C','A','B','C',],
                'degisken1': [10,23,33,22,11,99],
                 'degisken2': [100,253,333,262,111,969]}, 
                 columns=['guruplar','degisken1','degisken2'])
df

  guruplar  degisken1  degisken2
0        A         10        100
1        B         23        253
2        C         33        333
3        A         22        262
4        B         11        111
5        C         99        969

## aggregate

In [76]:
df.groupby('guruplar').mean()

          degisken1  degisken2
guruplar
A              16.0      181.0
B              17.0      182.0
C              66.0      651.0

In [77]:
df.groupby('guruplar').min()

          degisken1  degisken2
guruplar
A                10        100
B                11        111
C                33        333

In [78]:
df.groupby('guruplar').median()

          degisken1  degisken2
guruplar
A              16.0      181.0
B              17.0      182.0
C              66.0      651.0

In [79]:
df.groupby('guruplar').std()

          degisken1   degisken2
guruplar
A          8.485281  114.551299
B          8.485281  100.409163
C         46.669048  449.719913

In [88]:
df.groupby('guruplar').aggregate(['min',np.median, max]).T

guruplar              A      B      C
degisken1 min      10.0   11.0   33.0
          median   16.0   17.0   66.0
          max      22.0   23.0   99.0
degisken2 min     100.0  111.0  333.0
          median  181.0  182.0  651.0
          max     262.0  253.0  969.0

In [95]:
df.groupby('guruplar').aggregate({'degisken1': 'min', 'degisken2': 'max'})

          degisken1  degisken2
guruplar
A                10        262
B                11        253
C                33        969

## filter

In [96]:
df

  guruplar  degisken1  degisken2
0        A         10        100
1        B         23        253
2        C         33        333
3        A         22        262
4        B         11        111
5        C         99        969

In [97]:
def filter_func(x):
    return x['degisken1'].std()>9

In [98]:
df.groupby('guruplar').filter(filter_func)

  guruplar  degisken1  degisken2
2        C         33        333
5        C         99        969

In [99]:
df.groupby('guruplar').std()

          degisken1   degisken2
guruplar
A          8.485281  114.551299
B          8.485281  100.409163
C         46.669048  449.719913

## Transform Fonksiyonu

In [100]:
df

  guruplar  degisken1  degisken2
0        A         10        100
1        B         23        253
2        C         33        333
3        A         22        262
4        B         11        111
5        C         99        969

In [102]:
df['degisken1'] * 2

0     20
1     46
2     66
3     44
4     22
5    198
Name: degisken1, dtype: int64

In [117]:
df_a=df.iloc[:,1:3]  #gözlem değilşken

In [118]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [119]:
df

  guruplar  degisken1  degisken2
0        A         10        100
1        B         23        253
2        C         33        333
3        A         22        262
4        B         11        111
5        C         99        969

In [122]:
df_a.transform(lambda x: ( x-x.mean())/x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

## Apply

In [123]:
?df.apply

Signature:
df.apply(
    func: 'AggFuncType',
    axis: 'Axis' = 0,
    raw: 'bool' = False,
    result_type: "Literal['expand', 'reduce', 'broadcast'] | None" = None,
    args=(),
    **kwargs,
)
Docstring:
Apply a function along an axis of the DataFrame.

Objects passed to the function are Series objects whose index is
either the DataFrame's index (``axis=0``) or the DataFrame's columns
(``axis=1``). By default (``result_type=None``), the final return type
is inferred from the return type of the applied function. Otherwise,
it depends on the `result_type` argument.

Parameters
----------
func : function
    Function to apply to each column or row.
axis : {0 or 'index', 1 or 'columns'}, default 0
    Axis along which the function is applied:

    * 0 or 'index': apply function to each column.
    * 1 or 'columns': apply function to each row.

raw : bool, default False
    Determines if row or column is passed as a Series or ndarray object:

    * ``False`` : passes each row or column as a Series to the
      function.
    * ``True`` : the passed function will receive ndarray objects
      instead.
      If you are just applying a NumPy reduction function this will
      achieve much better performance.

result_type : {'expand', 'reduce', 'broadcast', None}, default None
    These only act when ``axis=1`` (columns):

    * 'expand' : list-like results will be turned into columns.
    * 'reduce' : returns a Series if possible rather than expanding
      list-like results. This is the opposite of 'expand'.
    * 'broadcast' : results will be broadcast to the original shape
      of the DataFrame, the original index and columns will be
      retained.

    The default behaviour (None) depends on the return value of the
    applied function: list-like results will be returned as a Series
    of those. However if the apply function returns a Series these
    are expanded to columns.
args : tuple
    Positional arguments to pass to `func` in addition to the
    array/series.
**kwargs
    Additional keyword arguments to pass as keywords arguments to
    `func`.

Returns
-------
Series or DataFrame
    Result of applying ``func`` along the given axis of the
    DataFrame.

See Also
--------
DataFrame.applymap: For elementwise operations.
DataFrame.aggregate: Only perform aggregating type operations.
DataFrame.transform: Only perform transforming type operations.

Notes
-----
Functions that mutate the passed object can produce unexpected
behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
for more details.

Examples
--------
>>> df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
>>> df
   A  B
0  4  9
1  4  9
2  4  9

Using a numpy universal function (in this case the same as
``np.sqrt(df)``):

>>> df.apply(np.sqrt)
     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

Using a reducing function on either axis

>>> df.apply(np.sum, axis=0)
A    12
B    27
dtype: int64

>>> df.apply(np.sum, axis=1)
0    13
1    13
2    13
dtype: int64

Returning a list-like will result in a Series

>>> df.apply(lambda x: [1, 2], axis=1)
0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

Passing ``result_type='expand'`` will expand list-like results
to columns of a Dataframe

>>> df.apply(lambda x: [1, 2], axis=1, result_type='expand')
   0  1
0  1  2
1  1  2
2  1  2

Returning a Series inside the function is similar to passing
``result_type='expand'``. The resulting column names
will be the Series index.

>>> df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)
   foo  bar
0    1    2
1    1    2
2    1    2

Passing ``result_type='broadcast'`` will ensure the same shape
result, whether list-like or scalar is returned by the function,
and broadcast it along the axis. The resulting column names will
be the originals.

>>> df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')
   A  B
0  1  2
1  1  2
2  1  2
File:      c:\users\kazan\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [124]:
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [125]:
df_a.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [127]:
df_a.apply('mean')

degisken1     33.0
degisken2    338.0
dtype: float64

In [128]:
df

  guruplar  degisken1  degisken2
0        A         10        100
1        B         23        253
2        C         33        333
3        A         22        262
4        B         11        111
5        C         99        969

In [130]:
df.groupby('guruplar').apply(np.mean)

C:\Users\kazan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\kazan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x00000294D8A1F7F0> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\kazan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\kazan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x00000294D8A1F7F0> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\kazan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\kazan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3430: FutureWarning: The operation <function mean at 0x00000294D8A1F7F0> failed on a column. If any error is raised, this will raise an exception in a future version of pandas. Drop these columns to avoid this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

          degisken1  degisken2
guruplar
A              16.0      181.0
B              17.0      182.0
C              66.0      651.0

## Pivot Tabloları

In [150]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [133]:
titanic.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [137]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [138]:
titanic.axes

[RangeIndex(start=0, stop=891, step=1),
 Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
        'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
        'alive', 'alone'],
       dtype='object')]

In [160]:
titanic.groupby(['sex','class'])[['survived']].aggregate('mean').unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [166]:
titanic.pivot_table('survived', index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [169]:
titanic[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [171]:
age= pd.cut(titanic['age'],[0,18,90])

In [173]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [177]:
titanic.pivot_table('survived', ['sex',age], columns= 'class' )

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

## Dış Kaynaklı Veri Okumak

In [181]:
## csv okuma
df= pd.read_csv('ornekcsv.csv', sep=';')

In [182]:
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [184]:
## txt okuma
df= pd.read_csv('duz_metin.txt')

In [185]:
df

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [ ]:
##xlsx okuma